
/*
    1.
    Создать проект , имя проекта primitives
    В методе main создать все типы примитивных переменных
    Инициализировать их значениями
    Все значения вывести на экран
*/

package com.homework.primetives;

public class Main {
    public static void main(String[] args) {
        int a = 10;
        long b = 20;
        byte c = 8;
        short e = 16;
        char ch = 'c';
        boolean t =true;
        float y = 1.4f;
        double k = 5.8;

        System.out.println(a);
        System.out.println(b);
        System.out.println(c);
        System.out.println(e);
        System.out.println(ch);
        System.out.println(t);
        System.out.println(y);
        System.out.println(k);

    }
}